In [1]:
import numpy as np

In [7]:
arr2 = ([1,2,3],[4,5,6])

In [8]:
import numpy as np

In [9]:
arr2

([1, 2, 3], [4, 5, 6])

In [10]:
# from pandas import Series, DataFrama

ImportError: cannot import name 'DataFrama'

In [11]:
from pandas import Series, DataFrame #library for data

In [12]:
import pandas as pd

In [13]:
import numpy as np

In [14]:
obj = Series ([4,7,-5,3])

In [15]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [16]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [17]:
obj2 = Series([4,7,-5,3], index = ['d','b','a','c']) #in series, we can create our

In [18]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [19]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [20]:
obj2[0]

4

In [21]:
obj2['d'] #value 4 at index d which is also same as index 0

4

In [22]:
obj2['d'] = 6

In [23]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [24]:
obj2[['a','b,'c]]

SyntaxError: invalid syntax (<ipython-input-24-9f8fa0b8dbce>, line 1)

In [25]:
obj2[['a','b,'c]]

SyntaxError: invalid syntax (<ipython-input-25-9f8fa0b8dbce>, line 1)

In [26]:
obj2[['a','b','c']]

a   -5
b    7
c    3
dtype: int64

In [27]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [28]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [29]:
np.exp(obj)

0      54.598150
1    1096.633158
2       0.006738
3      20.085537
dtype: float64

In [30]:
'b' in obj2

True

In [31]:
'e' in obj2

False

In [32]:
sdata = {'Seoul': 12000, 'Busan': 5000, 'Gwangju': 3000,'Daegu':1500} # its a dictionary

In [33]:
sdata #output is a dictionary

{'Busan': 5000, 'Daegu': 1500, 'Gwangju': 3000, 'Seoul': 12000}

In [34]:
obj3 = Series(sdata) #making dictionary as Series.

In [35]:
obj3

Busan       5000
Daegu       1500
Gwangju     3000
Seoul      12000
dtype: int64

In [36]:
obj3[0]

5000

In [37]:
cities = ['Seoul','Busan', 'Gwangju','Daegu']

In [38]:
obj4 = Series(sdata, index = cities) #making obj4 according to cities index

In [39]:
obj4

Seoul      12000
Busan       5000
Gwangju     3000
Daegu       1500
dtype: int64

In [40]:
cities = ['Seoul','Busan', 'Gwangju','Daegu', 'Daejon']

In [41]:
obj4 = Series(sdata, index = cities)

In [42]:
obj4

Seoul      12000.0
Busan       5000.0
Gwangju     3000.0
Daegu       1500.0
Daejon         NaN
dtype: float64

In [43]:
pd.isnull(obj4)

Seoul      False
Busan      False
Gwangju    False
Daegu      False
Daejon      True
dtype: bool

In [44]:
obj4.isnull()

Seoul      False
Busan      False
Gwangju    False
Daegu      False
Daejon      True
dtype: bool

In [45]:
obj4.name = 'population'

In [46]:
obj4.index.name = 'cities'

In [47]:
obj4

cities
Seoul      12000.0
Busan       5000.0
Gwangju     3000.0
Daegu       1500.0
Daejon         NaN
Name: population, dtype: float64

# Data Frame

In [48]:
data = {'cities': ['Seoul','Seoul','Seoul','Busan','Busan'],
        'year': [2000,2001,2002,2001,2002],
        'pop': [8,8.2,8.4,3,3.2]}

In [49]:
frame = DataFrame (data) #dataframe is colletion of series, one columns is one series,

In [50]:
frame

  cities  pop  year
0  Seoul  8.0  2000
1  Seoul  8.2  2001
2  Seoul  8.4  2002
3  Busan  3.0  2001
4  Busan  3.2  2002

In [51]:
DataFrame(data, columns = ['year', 'cities','pop'])

   year cities  pop
0  2000  Seoul  8.0
1  2001  Seoul  8.2
2  2002  Seoul  8.4
3  2001  Busan  3.0
4  2002  Busan  3.2

In [53]:
frame2 = DataFrame(data, columns = ['year','cities','pop','debt'],
                  index = ['one','two','three','found','fiver'])

In [54]:
frame2

       year cities  pop debt
one    2000  Seoul  8.0  NaN
two    2001  Seoul  8.2  NaN
three  2002  Seoul  8.4  NaN
found  2001  Busan  3.0  NaN
fiver  2002  Busan  3.2  NaN

In [55]:
frame2.columns

Index(['year', 'cities', 'pop', 'debt'], dtype='object')

In [56]:
frame2['cities']

one      Seoul
two      Seoul
three    Seoul
found    Busan
fiver    Busan
Name: cities, dtype: object

In [57]:
frame2.ix['three'] #in order to access data of one row

year       2002
cities    Seoul
pop         8.4
debt        NaN
Name: three, dtype: object

In [58]:
frame2['debt'] = 16.5

In [59]:
frame2

       year cities  pop  debt
one    2000  Seoul  8.0  16.5
two    2001  Seoul  8.2  16.5
three  2002  Seoul  8.4  16.5
found  2001  Busan  3.0  16.5
fiver  2002  Busan  3.2  16.5

In [61]:
frame2['debt'] = np.arange(5)

In [62]:
frame2

       year cities  pop  debt
one    2000  Seoul  8.0     0
two    2001  Seoul  8.2     1
three  2002  Seoul  8.4     2
found  2001  Busan  3.0     3
fiver  2002  Busan  3.2     4

In [64]:
val = Series([-1.2, -1.5,-1.7], index = ['two','found','fiver'])

In [66]:
frame2['debt'] = val

In [67]:
frame2

       year cities  pop  debt
one    2000  Seoul  8.0   NaN
two    2001  Seoul  8.2  -1.2
three  2002  Seoul  8.4   NaN
found  2001  Busan  3.0  -1.5
fiver  2002  Busan  3.2  -1.7

In [68]:
frame2['eastern'] = frame2['cities'] == 'Seoul'

In [69]:
frame2

       year cities  pop  debt eastern
one    2000  Seoul  8.0   NaN    True
two    2001  Seoul  8.2  -1.2    True
three  2002  Seoul  8.4   NaN    True
found  2001  Busan  3.0  -1.5   False
fiver  2002  Busan  3.2  -1.7   False

In [70]:
frame2 = DataFrame(data, columns = ['year','cities','pop','debt'],
                  index = ['one','two','three','four','five'])

In [71]:
frame2

       year cities  pop debt
one    2000  Seoul  8.0  NaN
two    2001  Seoul  8.2  NaN
three  2002  Seoul  8.4  NaN
four   2001  Busan  3.0  NaN
five   2002  Busan  3.2  NaN

In [72]:
val = Series([-1.2, -1.5,-1.7], index = ['two','found','fiver'])

In [73]:
frame2['debt'] = val

In [74]:
frame2['eastern'] = frame2['cities'] == 'Seoul'

In [75]:
frame2

       year cities  pop  debt eastern
one    2000  Seoul  8.0   NaN    True
two    2001  Seoul  8.2  -1.2    True
three  2002  Seoul  8.4   NaN    True
four   2001  Busan  3.0   NaN   False
five   2002  Busan  3.2   NaN   False

In [76]:
del frame2['eastern']

In [77]:
frame2

       year cities  pop  debt
one    2000  Seoul  8.0   NaN
two    2001  Seoul  8.2  -1.2
three  2002  Seoul  8.4   NaN
four   2001  Busan  3.0   NaN
five   2002  Busan  3.2   NaN

# Indexing, Selection and Filtering

In [78]:
obj = Series(np.arange(4), index = ['a','b','c','d'])

In [79]:
obj

a    0
b    1
c    2
d    3
dtype: int32

In [80]:
obj[2:4]

c    2
d    3
dtype: int32

In [81]:
obj[['b','a','d']]

b    1
a    0
d    3
dtype: int32

In [82]:
obj[[1,3]]

b    1
d    3
dtype: int32

In [84]:
data = DataFrame(np.arange(16).reshape ((4,4)),
        index = ['Seoul','Busan','Gwangju','Daejon'],
    columns = ['one','two','three','four'])

In [85]:
data

         one  two  three  four
Seoul      0    1      2     3
Busan      4    5      6     7
Gwangju    8    9     10    11
Daejon    12   13     14    15

In [86]:
data ['two']

Seoul       1
Busan       5
Gwangju     9
Daejon     13
Name: two, dtype: int32

In [87]:
data[['three']]

         three
Seoul        2
Busan        6
Gwangju     10
Daejon      14

In [88]:
data[:2]

       one  two  three  four
Seoul    0    1      2     3
Busan    4    5      6     7

In [89]:
data[:Gwangju]

NameError: name 'Gwangju' is not defined

In [90]:
data[:'Gwangju']

         one  two  three  four
Seoul      0    1      2     3
Busan      4    5      6     7
Gwangju    8    9     10    11

In [91]:
data [data['three']>5]

         one  two  three  four
Busan      4    5      6     7
Gwangju    8    9     10    11
Daejon    12   13     14    15

In [92]:
data < 5

           one    two  three   four
Seoul     True   True   True   True
Busan     True  False  False  False
Gwangju  False  False  False  False
Daejon   False  False  False  False

In [93]:
data[data < 5] = 0  #replacing values less than 5 as 0

In [94]:
data

         one  two  three  four
Seoul      0    0      0     0
Busan      0    5      6     7
Gwangju    8    9     10    11
Daejon    12   13     14    15

In [95]:
data.ix['Busan']

one      0
two      5
three    6
four     7
Name: Busan, dtype: int32

In [96]:
data.ix['Busan',['two','three']]

two      5
three    6
Name: Busan, dtype: int32

In [97]:
data.ix[['Busan','Gwangju'],[3,0,1]]

         four  one  two
Busan       7    0    5
Gwangju    11    8    9

In [98]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Gwangju, dtype: int32

In [99]:
data.ix[:'Gwangju','two']

Seoul      0
Busan      5
Gwangju    9
Name: two, dtype: int32

In [100]:
data.ix[data.three > 5, :3] #want to know the index where column are greater than 5

         one  two  three
Busan      0    5      6
Gwangju    8    9     10
Daejon    12   13     14

# Function application and mapping

In [101]:
frame = DataFrame (np.random.randn(4,3),
                  columns = list('bde'),
                  index = ['Seoul','Busan','Gwangju','Daejon'])

In [102]:
frame

                b         d         e
Seoul    0.436784 -0.187088 -2.662755
Busan   -0.289674 -1.909138  1.232503
Gwangju  0.398965  0.710530  1.178969
Daejon  -0.279881  0.277009 -0.981770

In [103]:
np.abs(frame)

                b         d         e
Seoul    0.436784  0.187088  2.662755
Busan    0.289674  1.909138  1.232503
Gwangju  0.398965  0.710530  1.178969
Daejon   0.279881  0.277009  0.981770

In [104]:
f = lambda x: x.max() - x.min()   #same as f(x)

In [105]:
frame.apply(f)

b    0.726458
d    2.619669
e    3.895258
dtype: float64

In [108]:
def f(x):
    return Series([x.min(), x.max()], index = ['min','max'])

In [109]:
frame.apply(f)

            b         d         e
min -0.289674 -1.909138 -2.662755
max  0.436784  0.710530  1.232503

In [110]:
format = lambda x: '%.2f' % x  #to show resutls upto just 2 decimal points

In [111]:
frame.applymap(format)

             b      d      e
Seoul     0.44  -0.19  -2.66
Busan    -0.29  -1.91   1.23
Gwangju   0.40   0.71   1.18
Daejon   -0.28   0.28  -0.98

In [112]:
frame['e'].map(format)

Seoul      -2.66
Busan       1.23
Gwangju     1.18
Daejon     -0.98
Name: e, dtype: object

# Sorting and ranking

In [115]:
obj = Series (range(4), index = ['d','b','c','a'])

In [116]:
obj.sort_index()

a    3
b    1
c    2
d    0
dtype: int32

In [117]:
frame = DataFrame(np.arange(8).reshape((2,4)), index = ['three','one'], colums = ['d','b','c','a'])

TypeError: __init__() got an unexpected keyword argument 'colums'

In [118]:
frame = DataFrame(np.arange(8).reshape((2,4)), index = ['three','one'], columns = ['d','b','c','a'])

In [119]:
frame.sort_ndex()

AttributeError: 'DataFrame' object has no attribute 'sort_ndex'

In [120]:
frame.sort_index() #sorting on the basis of row in alphabetically order

       d  b  c  a
one    4  5  6  7
three  0  1  2  3

In [121]:
frame.sort_index(axis = 1)

       a  b  c  d
three  3  1  2  0
one    7  5  6  4

In [122]:
obj = Series([4,np.nan],7,np.nan,-1,2) #in series we can based on values, and np.nan means NULL Values

TypeError: Index(...) must be called with a collection of some kind, 7 was passed

In [123]:
obj = Series([4,np.nan,7,np.nan,-1,2]) #in series we can based on values, and np.nan means NULL Values

In [124]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -1.0
5    2.0
dtype: float64

In [125]:
obj.sort_values()

4   -1.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [126]:
#frame = DataFrame({'b' : [4,7,-3,2],'a':[0,1,0,1]})

In [127]:
frame.sort_values(by='b')

       d  b  c  a
three  0  1  2  3
one    4  5  6  7

In [128]:
frame.sort_values(by = ['a','b'])

       d  b  c  a
three  0  1  2  3
one    4  5  6  7

In [129]:
frame = DataFrame({'b' : [4,7,-3,2],'a':[0,1,0,1]})

In [130]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [131]:
frame.sort_values(by = ['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

# Summarizing and COmputing Descriptive Statistics

In [132]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan, np.nan],[o.75,-1.3]],
              index = ['a','b','c','d'],
              columns = ['one','two'])

SyntaxError: invalid syntax (<ipython-input-132-9a41502eaef2>, line 1)

In [133]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan, np.nan],[0.75,-1.3]],
              index = ['a','b','c','d'],
              columns = ['one','two'])

In [134]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [135]:
df.sum() #summing columns

one    9.25
two   -5.80
dtype: float64

In [136]:
df.sum(axis =1 ) #summing rows

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [137]:
df.mean(axis = 1, skipna = False) #skip not available and exclude NA values and dont calculate mean for that row

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [138]:
df.mean(axis = 1, skipna = True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [139]:
df.idxmax() #which column gives the maximum value

one    b
two    d
dtype: object

In [140]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [141]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [142]:
obj = Series (['a','a','b','c']*4)

In [143]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [144]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

# Correlation and Covariance

In [145]:
import pandas.io.data as web

ImportError: The pandas.io.data module is moved to a separate package (pandas-datareader). After installing the pandas-datareader package (https://github.com/pandas-dev/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.

In [146]:
import pandas.io.data as web

ImportError: The pandas.io.data module is moved to a separate package (pandas-datareader). After installing the pandas-datareader package (https://github.com/pandas-dev/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.

In [147]:
all_data = {}

In [148]:
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000','1/1/2010')

NameError: name 'web' is not defined

In [149]:
all_data = {}

In [ ]:
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000','1/1/2010')

NameError: name 'web' is not defined